load-testing/scenarios/artillery-socketio.yml
config:
  target: "http://localhost:3000"
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm-up"
    
    # Ramp-up phase
    - duration: 300
      arrivalRate: 5
      rampTo: 50
      name: "Ramp-up"
    
    # Sustained load
    - duration: 600
      arrivalRate: 50
      name: "Sustained Load"
    
    # Spike test
    - duration: 60
      arrivalRate: 200
      name: "Spike"
    
    # Cool down
    - duration: 120
      arrivalRate: 10
      name: "Cool-down"
  
  # Socket.IO specific configuration
  socketio:
    transports: ["polling","websocket"]
    path: "/socket.io"
  
  # Variables for test data
  variables:
    usernames:
      - "testuser1"
      - "testuser2"
      - "testuser3"
      - "testuser4"
      - "testuser5"
    
    messages:
      - "مرحبا، هذه رسالة اختبارية"
      - "Hello, this is a test message"
      - "Testing Socket.IO performance"
      - "اختبار أداء Socket.IO"
      - "Real-time messaging test"
      - "🚀 Performance test in progress"
      - "Testing Arabic: السلام عليكم"
      - "Quick message test"
      - "Lorem ipsum dolor sit amet"
      - "Final test message"
    
    rooms:
      - "general"
      - "random"
      - "tech"
      - "support"
      - "announcements"
    
    statuses:
      - "online"
      - "away"
      - "busy"
      - "offline"
  
  # Processor for custom logic
  processor: "./artillery-processor.js"
  
  # Plugins
  plugins:
    expect: {}
    metrics-by-endpoint: {}

scenarios:
  - name: "Complete Socket.IO User Flow"
    engine: socketio
    weight: 70
    flow:
      # Establish connection (Socket.IO connect implicit)
      - think: 1

      # Authenticate using issued token from processor (Authorization header)
      - emit:
          channel: "auth"
          data:
            token: "{{ token }}"
      
      # Wait for auth response
      - think: 1
      
      # Join room
      - emit:
          channel: "joinRoom"
          data:
            roomId: "{{ rooms }}"
      
      # Send messages
      - loop:
        - emit:
            channel: "publicMessage"
            data:
              content: "{{ messages }}"
              roomId: "{{ rooms }}"
        
        - think: 2
        count: 10
      
      # Typing indicators
      - emit:
          channel: "typing"
          data:
            roomId: "{{ rooms }}"
            isTyping: true
      
      - think: 2
      
      - emit:
          channel: "typing"
          data:
            roomId: "{{ rooms }}"
            isTyping: false
      
      # Update status
      - emit:
          channel: "requestOnlineUsers"
          data: {}
      
      # Listen for messages
      - think: 5
      
      # Leave room
      - emit:
          channel: "leaveRoom"
          data:
            roomId: "{{ rooms }}"
      
      # Disconnect
      - emit:
          channel: "disconnect"
          data:
            reason: "test_complete"

  - name: "Message Burst Test"
    engine: socketio
    weight: 20
    flow:
      - think: 1
      - emit:
          channel: "auth"
          data:
            token: "{{ token }}"
      
      # Rapid message sending
      - loop:
        - emit:
            channel: "publicMessage"
            data:
              content: "Burst message {{ $loopCount }}"
              roomId: "general"
        
        - think: 0.1
        count: 50
      
      - emit:
          channel: "disconnect"

  - name: "Room Hopping Test"
    engine: socketio
    weight: 10
    flow:
      - think: 1
      - emit:
          channel: "auth"
          data:
            token: "{{ token }}"
      
      # Join and leave multiple rooms
      - loop:
        - emit:
            channel: "joinRoom"
            data:
              roomId: "{{ rooms }}"
        
        - think: 3
        
        - emit:
            channel: "publicMessage"
            data:
              content: "Hello from room hopper"
              roomId: "{{ rooms }}"
        
        - think: 2
        
        - emit:
            channel: "leaveRoom"
            data:
              roomId: "{{ rooms }}"
        
        count: 5
      
      - emit:
          channel: "disconnect"

# Expectations for validation
expect:
  - statusCode: 200
  - contentType: json
  - hasProperty: success